#_author_:王丽
#editor:王丽  2015.10.19

Feature: 经营报告-经营概况——概况数据
"""
    说明：
    1）统计整个店铺的订单包含‘本店’和‘商城’的两部分
    2）有效订单：订单状态为“待发货”、“已发货”、“已完成”的订单

    一、查询条件
        1、刷选日期
            1）开始日期和结束日期都为空；选择开始结束日期，精确到日期
            2）开始日期或者结束日期，只有一个为空，给出系统提示“请填写XX日期”
            3）默认为‘最近7天’，筛选日期：‘七天前’到‘今天’
            4）包含筛选日期的开始和结束的边界值
            5）手工设置筛选日期，点击查询后，‘快速查询’的所有项都处于‘未选中状态’，时间和选项匹配的，选项处于选中状态
        2、快速查看
            1）今天：查询的当前日期，例如，今天是2015-6-16，筛选日期是：2015-6-16到2015-6-16
            2）昨天：查询的前一天，例如，今天是2015-6-16，筛选日期是：2015-6-15到2015-6-15
            3）最近7天；包含今天，向前7天；例如，今天是2015-6-16，筛选日期是：2015-6-10到2015-6-16
            4）最近30天；包含今天，向前30天；例如，今天是2015-6-16，筛选日期是：2015-5-19到2015-6-16
            5）最近90天；包含今天，向前90天；例如，今天是2015-6-16，筛选日期：2015-3-19到2015-6-16
            6）全部：筛选日期更新到：2013.1.1到今天
            7）打印：打印‘经营概况’页签的内同，包含按钮

    二、店铺经营概况
        1、【成交金额】：=∑订单.实付金额[(订单.下单时间 in 查询区间) and (订单.订单状态 in {待发货、已发货、已完成})]

            "？"说明弹窗：当前所选时段内该店铺已支付订单和货到付款提交成功订单的总金额

        2、【成交订单】：=∑订单.个数[(订单.下单时间 in 查询区间) and (订单.订单状态 in {待发货、已发货、已完成})]

                    "？"说明弹窗：当前所选时段内该店铺已发货、待发货、已完成的订单数之和
        3、【购买总人数】：=∑订单.买家个数[(订单.下单时间 in 查询区间) and (订单.订单状态 in {待发货、已发货、已完成})]
                                +∑订单.个数[(买家未知) and (订单.下单时间 in 查询区间) and (订单.订单状态 in {待发货、已发货、已完成})]

            备注：重复下单的买家不累加；买家未知的按照内部ID区分

            "？"说明弹窗：购买商品的总人数

        4、【客单价】：=【成交金额】/【成交订单】

            "？"说明弹窗：当前所选时段内平均每个订单的金额


    需求变更删除的部分
            二、店铺经营概况-综合
                1、【会员复购率】：=∑(复购会员数/【下单会员】)*100% 
                    1）【复购会员数】=∑订单.买家个数[(订单.下单时间 in 查询区间) and (订单.来源="本店") and (订单.订单状态 in {待发货、已发货、已完成}) and (订单.订单编号[(订单.买家=该订单.买家) and (订单.下单时间<该订单.下单时间) and (订单.订单状态 in {待发货、已发货、已完成}) and (订单.来源 ='本店')].exist) 

                    备注：满足下面条件的订单的买家个数总和；（1）下单时间在查询区间内的有效订单（1）订单的买家在该订单下单时间之前有‘有效订单’

                    2）【下单会员】：=∑订单.买家个数[(订单.下单时间 in 查询区间) and (订单.来源 ='本店') and (订单.订单状态 in {待发货、已发货、已完成})]   

                    备注：‘下单时间’在查询区间内的有效订单的买家个数，重复的会员不重复累加
                    "？"说明弹窗：时间段内，再次购买人数/总购买人数x100%    

         
                2、【会员推荐率】：(【发起扫码会员】+ 【发起分享链接会员】)/查询结束时间点时系统的会员总数 * 100%
                    1）【发起扫码会员】：在查询区间内发起‘有效扫码’的会员数
                        ‘有效扫码’：发起推广扫码或者带参数二维码，以二维码生成的时间为准

                    2）【发起分享链接会员】：在查询区间内发起‘有效分享链接’的会员数
                        ‘有效分享链接’：发起分享链接的并且此链接被第一次点击的时间在查询区间

                    3）查询结束时间点时系统的会员总数
                        例如：筛选日期：2015-5-1到2015-5-22
                            查询结束时间点时系统的会员总数=∑会员.个数[会员.加入时间 < 2015-5-23 00:00]

                    备注：会员总数包含会员状态为‘关注’和‘已取消’的

                    "？"说明弹窗：时间段内，发起推荐会员数/会员总数x100%

            四、店铺经营概况-会员
                1、【发起扫码会员】：在查询区间内发起‘有效扫码’的会员数
                    ‘有效扫码’：发起推广扫码或者带参数二维码，以二维码生成的时间为准

                    "？"说明弹窗：发起推广扫码的会员数

                2、【扫码新增会员】：=∑会员.个数[(会员.加入时间 in 查询区间) and (会员.来源 = ‘推广扫码’)]

                    备注：在查询区间内通过扫码新增的会员数，包括推广扫码和带参数二维码（包含会员发起和商家发起）

                    "？"说明弹窗：通过扫码新关注的会员数（包括推广扫码、带参数二维码）

                3、【发起分享链接会员】：在查询区间内发起‘有效分享链接’的会员数
                    ‘有效分享链接’：发起分享链接的并且此链接被第一次点击的时间在查询区间

                    "？"说明弹窗：发起分享链接的会员数

                4、【分享链接新增会员】：∑会员.个数[(会员.加入时间 in 查询区间) and (会员.来源 = ‘会员分享’)]

                    备注：在查询区间内通过分享链接新增的会员数

                    "？"说明弹窗：通过分享链接新关注的会员数
"""

Background:
    Given jobs登录系统
    And jobs设定会员积分策略
        """
        {
            "be_member_increase_count":500,
            "integral_each_yuan":10
        }
        """

    When jobs添加支付方式
        """
        [{
            "type": "货到付款",
            "description": "我的货到付款",
            "is_active": "启用"
        },{
            "type": "微信支付",
            "description": "我的微信支付",
            "is_active": "启用",
            "weixin_appid": "12345", 
            "weixin_partner_id": "22345", 
            "weixin_partner_key": "32345", 
            "weixin_sign": "42345"
        },{
            "type": "支付宝",
            "description": "我的支付宝支付",
            "is_active": "启用"
        }]
        """
    And jobs开通使用微众卡权限
    And jobs添加支付方式
        """
        [{
            "type": "微众卡支付",
            "description": "我的微众卡支付",
            "is_active": "启用"
        }]
        """
    Given jobs已创建微众卡
        """
        {
            "cards":[{
                "id":"0000001",
                "password":"1234567",
                "status":"未使用",
                "price":110.00
            },{
                "id":"0000002",
                "password":"1234567",
                "status":"未使用",
                "price":90.00
            }]
        }
        """
    
    When jobs添加商品规格
        """
        [{
            "name": "颜色",
            "type": "文字",
            "values": [{
                "name": "黑色"
            },{
                "name": "白色"
            }]
        }]
        """
    And jobs已添加商品
        """
        [{
            "name": "商品1",
            "promotion_title": "促销商品1",
            "category": "分类1",
            "postage": 10,
            "detail": "商品1详情",
            "swipe_images": [{
                "url": "/standard_static/test_resource_img/hangzhou1.jpg"
            }],
            "model": {
                "models": {
                    "standard": {
                        "price": 100.00,
                        "weight": 5.0,
                        "stock_type": "无限"
                    }
                }
            },
            "synchronized_mall":"是"
        },{
            "name": "商品2",
            "promotion_title": "促销商品2",
            "category": "分类1",
            "postage": 15,
            "detail": "商品2详情",
            "swipe_images": [{
                "url": "/standard_static/test_resource_img/hangzhou1.jpg"
            }],
            "is_enable_model": "启用规格",
            "model": {
                "models": {
                    "黑色": {
                        "price": 100.00,
                        "weight": 5.0,
                        "stock_type": "无限"
                    },
                    "白色": {
                        "price": 100.00,
                        "weight": 5.0,
                        "stock_type": "无限"
                    }
                }
            },
            "synchronized_mall":"是"
        }]
        """

    And jobs创建积分应用活动
        """
        [{
            "name": "商品1积分应用",
            "start_date": "2014-08-01",
            "end_date": "10天后",
            "product_name": "商品1",
            "is_permanant_active": "true",
            "rules": [{
                "member_grade": "全部会员",
                "discount": 20,
                "discount_money": 20.00
            }]
        },{
            "name": "商品2积分应用",
            "start_date": "2014-08-01",
            "end_date": "10天后",
            "product_name": "商品2",
            "is_permanant_active": "true",
            "rules": [{
                "member_grade": "全部会员",
                "discount": 20,
                "discount_money": 20.00
            }]
        }]
        """

    And jobs添加优惠券规则
        """
        [{
            "name": "全体券1",
            "money": 10,
            "start_date": "2014-08-01",
            "end_date": "10天后",
            "coupon_id_prefix": "coupon1_id_"
        }]
        """

    When jack关注jobs的公众号于'2014-07-01'
    When tom关注jobs的公众号于'2014-07-02'
    When marry关注jobs的公众号于'2014-07-03'

@mall2 @bi @salesAnalysis   @stats
Scenario:1  经营概况：店铺经营概况

    When 微信用户批量消费jobs的商品
        | order_id |    date    | consumer |    product   | payment | pay_type |postage*|price*| product_integral |       coupon         | paid_amount* |  weizoom_card     | alipay* | wechat* | cash* |   action      | order_status* |
        |   0001   | 2014-08-05 |   jack   | 商品1,1      |         | 支付宝   |   10   | 100  |       200        |                      |     90       |                   |   90    |    0    |   0   |               |    待支付     |
        |   0002   | 5天前      |   tom    | 商品1,1      |         | 支付宝   |   10   | 100  |       200        |                      |     90       |                   |   90    |    0    |   0   |  jobs,取消    |    已取消     |
        |   0003   | 4天前      |   tom    | 商品2,黑色,2 |   支付  | 微信支付 |   15   | 100  |        0         | 全体券1,coupon1_id_1 |     205      |                   |    0    |   205   |   0   |  jobs,发货    |    已发货     |
        |   0004   | 3天前      |   tom    | 商品2,白色,1 |   支付  | 货到付款 |   15   | 100  |        0         | 全体券1,coupon1_id_2 |     105      |  0000002,1234567  |    0    |    0    |   15  |  jobs,完成    |    已完成     |
        |   0005   | 2天前      |  marry   | 商品1,1      |   支付  | 支付宝   |   10   | 100  |       200        |                      |     90       |                   |    0    |    0    |   0   |  jobs,退款    |    退款中     |
        |   0006   | 今天       |  marry   | 商品1,1      |   支付  | 支付宝   |   10   | 100  |       200        |                      |     90       |                   |    0    |    0    |   0   |  jobs,完成退款|   退款成功    |
        |   0007   | 今天       |   -tom3  | 商品1,1      |   支付  | 货到付款 |   10   | 100  |        0         |                      |     110      |                   |    0    |    0    |   110 |               |    待发货     |
        |   0008   | 今天       |   -tom4  | 商品1,1      |   支付  | 支付宝   |   10   | 100  |        0         |                      |     110      |                   |   110   |    0    |   0   |               |    待发货     |

    Given jobs登录系统
    When jobs设置筛选日期
        """
        [{
            "begin_date":"5天前",
            "end_date":"今天"
        }]
        """
    
    And 查询'店铺经营概况'
    Then 获得店铺经营概况数据
        """
        {
            "buyer_count": 3,
            "transaction_money": "530.00",
            "vis_price": "132.50",
            "transaction_orders": 4
        }
        """





